In [23]:
import pandas as pd
dataset = pd.read_csv('C:\\Users\\lenovo\\Desktop\\Feature selection\\houses_price_dataset.csv')
dataset

,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus,Unnamed: 12,owner_name,price
0,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished,NaN,ahmed,13300000
1,8960,4,4,4,yes,no,no,no,yes,3,no,furnished,NaN,mohamed,12250000
2,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished,NaN,saad,12250000
3,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished,NaN,abeer,12215000
4,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished,NaN,huda,11410000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished,NaN,ahmed,1820000
541,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished,NaN,mohamed,1767150
542,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished,NaN,saad,1750000
543,2910,3,1,1,no,no,no,no,no,0,no,furnished,NaN,abeer,1750000
544,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished,NaN,huda,1750000

In [24]:
dataset.drop(['owner_name'],axis=1).head(1)

,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus,Unnamed: 12,price
0,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished,NaN,13300000